indoor/app/layout/common/device_discover_feedback_xml

#
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:tns="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:dn="http://www.onvif.org/ver10/network/wsdl" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:wsa5="http://www.w3.org/2005/08/addressing"><SOAP-ENV:Header><tns:AppSequence MessageNumber="%d" InstanceId="1"></tns:AppSequence><wsa:MessageID>urn:uuid:%s</wsa:MessageID><wsa:RelatesTo>%s</wsa:RelatesTo><wsa:To SOAP-ENV:mustUnderstand="true">urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To><wsa:Action SOAP-ENV:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action></SOAP-ENV:Header><SOAP-ENV:Body><tns:ProbeMatches><tns:ProbeMatch><wsa:EndpointReference><wsa:Address>urn:uuid:%s</wsa:Address></wsa:EndpointReference><tns:Types>dn:NetworkVideoTransmitter tds:Device</tns:Types><tns:Scopes>onvif://www.onvif.org/Profile/G onvif://www.onvif.org/Profile/Streaming onvif://www.onvif.org/Profile/T onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/max_resolution/1920*1080 onvif://www.onvif.org/register_status/offline  onvif://www.onvif.org/register_server/0.0.0.0:5063  onvif://www.onvif.org/regist_id/23-90-1B  onvif://www.onvif.org/type/IPC onvif://www.onvif.org/manufacturer/COMMAX onvif://www.onvif.org/VideoSourceNumber/1 onvif://www.onvif.org/version/CIP-B1216.2.71.C024251.220523 onvif://www.onvif.org/serial/210235TQXN322B001658 onvif://www.onvif.org/macaddr/%s  onvif://www.onvif.org/hardware/CIP-D20YS onvif://www.onvif.org/location/  onvif://www.onvif.org/name/CIP-D20YS </tns:Scopes><tns:XAddrs>http://%s:80/onvif/device_service</tns:XAddrs><tns:MetadataVersion>1</tns:MetadataVersion></tns:ProbeMatch></tns:ProbeMatches></SOAP-ENV:Body></SOAP-ENV:Envelope>